CFD Projects/Numerical Wave Tank/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Scale 1;

vertices
(
    //Water back
    (0 0 -0.5)             	     	//0
    (0 -5 -0.5)                    	//1 
    (50 -5 -0.5)                   	//2   
    (50 0 -0.5)      		      	//3 
    
    
    //Air back
    (50 3 -0.5) 			//4
    (0 3 -0.5)      			//5
    
    //Water front
    (0 0 0.5)                   	//6  
    (0 -5 0.5)           	  	//7
    (50 -5 0.5)                    	//8 
    (50 0 0.5)                    	//9
    
    //Air front
    (50 3 0.5)                  	//10
    (0 3 0.5)          		       	//11
   
);

blocks
(
    //Air
    hex (11 10 9 6 5 4 3 0) (100 20 1) simpleGrading (1 0.1 1)       	//0
    //Water
    hex (6 9 8 7 0 3 2 1) (100 30 1) simpleGrading (1 10 1)         	//1
      
);

edges
(
);

patches
(
    
    patch WaterInlet
    (
        (6 7 1 0)
    )
    patch AirInlet
    (
        (11 6 0 5)
    )
        
    patch Outlet
    (
        (10 9 3 4) 
        (9 8 2 3)
    )

    patch Top
    (
        //Air
        (11 10 4 5)
    )
   patch Bottom
    (
        //Water
        (7 8 2 1)
    )
    
    empty Back 
    (
    	//Air
       (5 0 3 4)
       //Water
       (0 1 2 3)
       
    )

    empty Front
    (
       //Air
       (11 6 9 10)
       //Water
       (6 7 8 9)
    )
     
);

mergePatchPairs
(
);

// ************************************************************************* //
