CFD Projects/Numerical Wave Tank/0_org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    WaterInlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }

    AirInlet
    {
        type            zeroGradient;
    }

    Outlet
    {
      	type            inletOutlet;
        inletValue      uniform 0;
       	value           uniform 0;
    }

    Top
    {
     	type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;;
    }
    
    Bottom
    {
        type            slip;
    }
    
    back
    {
        type            empty;
    }

    front
    {
        type            empty;
    }

}

// ************************************************************************* //
