CFD Projects/Numerical Wave Tank/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    // Set cell value (does zerogradient on boundaries)
    boxToCell
    {        box (-100 -100 -100) (100 0 100);

        fieldValues
        ( volScalarFieldValue alpha.water 1);
    }

    // Set patch values (using ==)
    boxToFace
     {       box (-100 -100 -100) (100 0 100);

        fieldValues
        (volScalarFieldValue alpha.water 1);
    }
);


// ************************************************************************* //
